# W1M3 - ETL 프로세스 구현하기

In [202]:
import requests
from bs4 import BeautifulSoup

In [203]:
html = requests.get("https://en.wikipedia.org/wiki/List_of_countries_by_GDP_%28nominal%29").text

In [204]:
soup = BeautifulSoup(html, 'html.parser')

In [205]:
gdp = soup.find("table", {"class": 'wikitable'}).find('tbody').find_all('tr')[3:]

In [206]:
gdp_imf = [[gdp_row.find_all('td')[i].text.strip() for i in range(2)] for gdp_row in gdp]
gdp_imf

[['United States', '30,337,162'],
 ['China', '19,534,894'],
 ['Germany', '4,921,563'],
 ['Japan', '4,389,326'],
 ['India', '4,271,922'],
 ['United Kingdom', '3,730,261'],
 ['France', '3,283,429'],
 ['Italy', '2,459,597'],
 ['Canada', '2,330,308'],
 ['Brazil', '2,307,162'],
 ['Russia', '2,195,708'],
 ['South Korea', '1,947,133'],
 ['Australia', '1,881,140'],
 ['Spain', '1,827,576'],
 ['Mexico', '1,817,818'],
 ['Indonesia', '1,492,618'],
 ['Turkey', '1,455,413'],
 ['Netherlands', '1,272,960'],
 ['Saudi Arabia', '1,136,580'],
 ['Switzerland', '999,604'],
 ['Poland', '915,451'],
 ['Taiwan', '814,438'],
 ['Belgium', '689,364'],
 ['Sweden', '638,780'],
 ['Ireland', '587,225'],
 ['Argentina', '574,201'],
 ['United Arab Emirates', '568,567'],
 ['Singapore', '561,725'],
 ['Austria', '559,218'],
 ['Israel', '550,905'],
 ['Thailand', '545,341'],
 ['Norway', '503,466'],
 ['Malaysia', '488,250'],
 ['Philippines', '471,516'],
 ['Vietnam', '468,400'],
 ['Iran', '463,747'],
 ['Bangladesh', '451,856'],
 ['Denmark', '431,228'],
 ['Hong Kong', '422,057'],
 ['Colombia', '419,331'],
 ['South Africa', '418,046'],
 ['Romania', '406,202'],
 ['Egypt', '380,044'],
 ['Pakistan', '374,595'],
 ['Chile', '362,240'],
 ['Czech Republic', '360,233'],
 ['Finland', '319,989'],
 ['Portugal', '319,934'],
 ['Kazakhstan', '306,629'],
 ['Peru', '294,898'],
 ['Iraq', '270,874'],
 ['Greece', '265,171'],
 ['Algeria', '264,270'],
 ['New Zealand', '262,924'],
 ['Hungary', '245,619'],
 ['Qatar', '226,217'],
 ['Nigeria', '194,955'],
 ['Ukraine', '189,827'],
 ['Morocco', '168,597'],
 ['Kuwait', '161,950'],
 ['Cuba', '—'],
 ['Ethiopia', '145,031'],
 ['Slovakia', '142,617'],
 ['Dominican Republic', '126,238'],
 ['Ecuador', '121,425'],
 ['Puerto Rico', '120,971'],
 ['Kenya', '116,321'],
 ['Angola', '113,286'],
 ['Uzbekistan', '112,653'],
 ['Guatemala', '112,369'],
 ['Oman', '109,993'],
 ['Bulgaria', '108,425'],
 ['Venezuela', '106,327'],
 ['Costa Rica', '95,149'],
 ['Luxembourg', '91,210'],
 ['Croatia', '89,665'],
 ['Panama', '87,347'],
 ['Ivory Coast', '86,993'],
 ['Sri Lanka', '74,846'],
 ['Turkmenistan', '83,883'],
 ['Lithuania', '82,789'],
 ['Uruguay', '82,605'],
 ['Serbia', '82,550'],
 ['Tanzania', '79,867'],
 ['Azerbaijan', '75,649'],
 ['Ghana', '75,307'],
 ['Slovenia', '73,198'],
 ['Belarus', '73,129'],
 ['DR Congo', '72,483'],
 ['Myanmar', '64,284'],
 ['Uganda', '55,587'],
 ['Macau', '53,447'],
 ['Cameroon', '53,391'],
 ['Jordan', '53,305'],
 ['Tunisia', '52,636'],
 ['Bolivia', '48,172'],
 ['Bahrain', '47,812'],
 ['Cambodia', '47,147'],
 ['Latvia', '45,521'],
 ['Paraguay', '44,937'],
 ['Libya', '44,812'],
 ['Nepal', '43,673'],
 ['Estonia', '43,044'],
 ['Honduras', '36,735'],
 ['Zimbabwe', '35,919'],
 ['El Salvador', '35,848'],
 ['Cyprus', '34,790'],
 ['Senegal', '33,685'],
 ['Georgia', '33,191'],
 ['Iceland', '32,919'],
 ['Papua New Guinea', '31,716'],
 ['Zambia', '29,872'],
 ['Bosnia and Herzegovina', '29,078'],
 ['Trinidad and Tobago', '28,365'],
 ['Sudan', '26,865'],
 ['Guinea', '25,447'],
 ['Albania', '25,431'],
 ['Armenia', '25,408'],
 ['Haiti', '24,046'],
 ['Mozambique', '22,975'],
 ['Malta', '22,737'],
 ['Mongolia', '21,943'],
 ['Burkina Faso', '21,902'],
 ['Mali', '21,662'],
 ['Botswana', '21,418'],
 ['Benin', '21,371'],
 ['Guyana', '21,178'],
 ['Gabon', '21,013'],
 ['Jamaica', '20,098'],
 ['Nicaragua', '18,829'],
 ['Niger', '18,816'],
 ['Chad', '18,697'],
 ['Palestine', '18,602'],
 ['Syria', '—'],
 ['Moldova', '18,356'],
 ['Lebanon', '21,780'],
 ['Yemen', '16,940'],
 ['Madagascar', '16,465'],
 ['Mauritius', '16,359'],
 ['North Macedonia', '15,873'],
 ['Kyrgyzstan', '15,770'],
 ['Brunei', '15,510'],
 ['Congo', '15,501'],
 ['Laos', '15,190'],
 ['North Korea', '—'],
 ['Afghanistan', '14,467'],
 ['Bahamas', '14,390'],
 ['Rwanda', '13,701'],
 ['Tajikistan', '13,000'],
 ['Somalia', '12,804'],
 ['Namibia', '12,765'],
 ['Kosovo', '11,318'],
 ['Malawi', '11,241'],
 ['Equatorial Guinea', '10,708'],
 ['Mauritania', '10,628'],
 ['Togo', '9,832'],
 ['New Caledonia', '—'],
 ['Monaco', '—'],
 ['Montenegro', '8,010'],
 ['Bermuda', '—'],
 ['Liechtenstein', '—'],
 ['Maldives', '7,199'],
 ['Barbados', '6,863'],
 ['Cayman Islands', '—'],
 ['South Sudan', '6,517'],
 ['French Polynesia', '—'],
 ['Fiji', '5,801'],
 ['Eswatini', '5,085'],
 ['Liberia', '4,754'],
 ['Sierra Leone', '4,558'],
 ['Djibouti', '4,364'],
 ['Suriname', '4,337'],
 ['Aruba', '4,069'],
 ['Andorra', '3,897'],
 ['Belize', '3,296'],
 ['Bhutan', '3,110'],
 ['Burundi', '3,075'],
 ['Curaçao', '—'],
 ['Greenland', '—'],
 ['Central African Republic', '2,810'],
 ['Cape Verde', '2,718'],
 ['Gambia', '2,694'],
 ['Saint Lucia', '2,582'],
 ['Lesotho', '2,395'],
 ['Eritrea', '—'],
 ['Zanzibar', '—'],
 ['Seychelles', '2,203'],
 ['Guinea-Bissau', '2,151'],
 ['Antigua and Barbuda', '2,127'],
 ['San Marino', '2,033'],
 ['East Timor', '1,992'],
 ['Solomon Islands', '1,707'],
 ['Sint Maarten', '—'],
 ['Comoros', '1,422'],
 ['Grenada', '1,406'],
 ['Turks and Caicos Islands', '—'],
 ['Vanuatu', '1,289'],
 ['Saint Kitts and Nevis', '1,134'],
 ['Saint Vincent and the Grenadines', '1,128'],
 ['Samoa', '1,024'],
 ['São Tomé and Príncipe', '751'],
 ['Dominica', '708'],
 ['Tonga', '581'],
 ['Micronesia', '484'],
 ['Kiribati', '311'],
 ['Palau', '308'],
 ['Marshall Islands', '305'],
 ['Nauru', '161'],
 ['Tuvalu', '66']]

In [249]:
import pandas as pd

df_gdp = pd.DataFrame(gdp_imf)
df_gdp

                    0           1
0       United States  30,337,162
1               China  19,534,894
2             Germany   4,921,563
3               Japan   4,389,326
4               India   4,271,922
..                ...         ...
204          Kiribati         311
205             Palau         308
206  Marshall Islands         305
207             Nauru         161
208            Tuvalu          66

[209 rows x 2 columns]

In [250]:
df_gdp.to_json('raw_data_gdp.json')

In [251]:
pd.read_json('raw_data_gdp.json')

                    0           1
0       United States  30,337,162
1               China  19,534,894
2             Germany   4,921,563
3               Japan   4,389,326
4               India   4,271,922
..                ...         ...
204          Kiribati         311
205             Palau         308
206  Marshall Islands         305
207             Nauru         161
208            Tuvalu          66

[209 rows x 2 columns]

In [252]:
df_gdp.columns = ['country', 'gdp']
df_gdp

              country         gdp
0       United States  30,337,162
1               China  19,534,894
2             Germany   4,921,563
3               Japan   4,389,326
4               India   4,271,922
..                ...         ...
204          Kiribati         311
205             Palau         308
206  Marshall Islands         305
207             Nauru         161
208            Tuvalu          66

[209 rows x 2 columns]

In [253]:
df_gdp['gdp'] = df_gdp['gdp'].apply(lambda x : int(x.replace(",","")) if x != '—' else None)
df_gdp['gdp'] = round(df_gdp['gdp']/1000, 2)
df_gdp

              country       gdp
0       United States  30337.16
1               China  19534.89
2             Germany   4921.56
3               Japan   4389.33
4               India   4271.92
..                ...       ...
204          Kiribati      0.31
205             Palau      0.31
206  Marshall Islands      0.30
207             Nauru      0.16
208            Tuvalu      0.07

[209 rows x 2 columns]

In [254]:
df_gdp = df_gdp.sort_values('gdp', ascending = False)
df_gdp

                      country       gdp
0               United States  30337.16
1                       China  19534.89
2                     Germany   4921.56
3                       Japan   4389.33
4                       India   4271.92
..                        ...       ...
178                 Greenland       NaN
184                   Eritrea       NaN
185                  Zanzibar       NaN
192              Sint Maarten       NaN
195  Turks and Caicos Islands       NaN

[209 rows x 2 columns]

In [255]:
df_100B = df_gdp[df_gdp['gdp'] >= 100]
df_100B

          country       gdp
0   United States  30337.16
1           China  19534.89
2         Germany   4921.56
3           Japan   4389.33
4           India   4271.92
..            ...       ...
68     Uzbekistan    112.65
69      Guatemala    112.37
70           Oman    109.99
71       Bulgaria    108.42
72      Venezuela    106.33

[72 rows x 2 columns]

In [294]:
import pycountry
import pycountry_convert as pc

alpha2 = pycountry.countries.search_fuzzy("Türkiye")[0].alpha_2
con_code = pc.country_alpha2_to_continent_code(alpha2)
con_code

'AS'

In [ ]:
alpha2 = pycountry.countries.search_fuzzy("Türkiye")[0].alpha_2
con_code = pc.country_alpha2_to_continent_code(alpha2)
con_code

In [327]:
region_map = {'DR Congo' : 'Democratic Republic of the Congo', 'Turkey' : 'Türkiye', 'kosovo' : 'Kosovo'}

In [328]:
df_gdp['country'] = df_gdp['country'].map(region_map).fillna(df_gdp['country'])
df_gdp['country']

0                 United States
1                         China
2                       Germany
3                         Japan
4                         India
                 ...
178                   Greenland
184                     Eritrea
185                    Zanzibar
192                Sint Maarten
195    Turks and Caicos Islands
Name: country, Length: 209, dtype: object

In [332]:
df_gdp[df_gdp['country'] == 'Kosovo']

    country    gdp
151  Kosovo  11.32

In [333]:
df_gdp['continent'] = df_gdp['country'].apply(lambda x : pc.country_alpha2_to_continent_code(pc.country_name_to_country_alpha2(x)))
df_gdp

KeyError: "Invalid Country Name: 'Kosovo'"

In [ ]:
df_gdp['continent'] = df_gdp['country'].apply(lambda x : pc.country_alpha2_to_continent_code(pc.countries.search_fuzzy(x)[0].alpha_2))
df_gdp

In [338]:
def country_to_continent(x) :
        try : continent = pc.country_alpha2_to_continent_code(pc.country_name_to_country_alpha2(x))
        except :
            exception_region_dict = {'DR Congo' : 'AF', 'Kosovo' : 'EU', 'Sint Maarten' : 'EU', 'Zanzibar' : 'AF', 'East Timor' : 'AS'}
            continent = exception_region_dict[x]
        return continent

df_gdp['continent'] = df_gdp['country'].apply(lambda x : country_to_continent(x))

In [339]:
df_gdp.groupby('continent').head(5).groupby('continent').mean('gdp').sort_values('gdp', ascending = False)

                gdp
continent
NA         6946.500
AS         6327.178
EU         3318.112
SA          791.566
OC          436.658
AF          285.184

In [89]:
import sqlite3

conn = sqlite3.connect('World_Economies.db')
df_100B.to_sql('Countries_by_GDP', conn, index = False)

72

In [ ]:
cur = conn.cursor()

In [90]:
pd.read_sql(
    """
    SELECT * FROM COUNTRIES_BY_GDP""", conn)

          country       gdp continent
0   United States  30337.16        NA
1           China  19534.89        AS
2         Germany   4921.56        EU
3           Japan   4389.33        AS
4           India   4271.92        AS
..            ...       ...       ...
67     Uzbekistan    112.65        AS
68      Guatemala    112.37        NA
69           Oman    109.99        AS
70       Bulgaria    108.42        EU
71      Venezuela    106.33        SA

[72 rows x 3 columns]

In [98]:
def exceed_100B() :
    conn = sqlite3.connect('World_Economies.db')
    cur = conn.cursor()
    df = pd.read_sql("SELECT * FROM Countries_by_GDP WHERE GDP > 100", conn)
    return df

In [179]:
def region_top5_average() :
    conn = sqlite3.connect('World_Economies.db')
    cur = conn.cursor()
    df = pd.read_sql(
        """SELECT AVG(GDP), CONTINENT
        FROM (SELECT * FROM 
        (SELECT *, ROW_NUMBER() OVER (PARTITION BY CONTINENT ORDER BY GDP DESC) AS RANK 
        FROM Countries_by_GDP) 
        WHERE RANK <=5)
        GROUP BY CONTINENT
        """, conn)
    return df

In [180]:
exceed_100B()

          country       gdp continent
0   United States  30337.16        NA
1           China  19534.89        AS
2         Germany   4921.56        EU
3           Japan   4389.33        AS
4           India   4271.92        AS
..            ...       ...       ...
67     Uzbekistan    112.65        AS
68      Guatemala    112.37        NA
69           Oman    109.99        AS
70       Bulgaria    108.42        EU
71      Venezuela    106.33        SA

[72 rows x 3 columns]

In [181]:
region_top5_average()

   AVG(GDP) continent
0   285.184        AF
1  6327.178        AS
2  3318.112        EU
3  6946.500        NA
4  1072.030        OC
5   791.566        SA

In [165]:
pd.read_sql(
        """SELECT *
        FROM (SELECT *, ROW_NUMBER() OVER (PARTITION BY CONTINENT ORDER BY GDP DESC) AS RANK 
        FROM Countries_by_GDP)
        WHERE RANK <= 5
        """, conn)

               country       gdp continent  RANK
0         South Africa    418.05        AF     1
1                Egypt    380.04        AF     2
2              Algeria    264.27        AF     3
3              Nigeria    194.96        AF     4
4              Morocco    168.60        AF     5
5                China  19534.89        AS     1
6                Japan   4389.33        AS     2
7                India   4271.92        AS     3
8          South Korea   1947.13        AS     4
9            Indonesia   1492.62        AS     5
10             Germany   4921.56        EU     1
11      United Kingdom   3730.26        EU     2
12              France   3283.43        EU     3
13               Italy   2459.60        EU     4
14              Russia   2195.71        EU     5
15       United States  30337.16        NA     1
16              Canada   2330.31        NA     2
17              Mexico   1817.82        NA     3
18  Dominican Republic    126.24        NA     4
19         Puerto Rico    120.97        NA     5
20           Australia   1881.14        OC     1
21         New Zealand    262.92        OC     2
22              Brazil   2307.16        SA     1
23           Argentina    574.20        SA     2
24            Colombia    419.33        SA     3
25               Chile    362.24        SA     4
26                Peru    294.90        SA     5

In [178]:
pd.read_sql(
        """SELECT AVG(GDP), CONTINENT
        FROM (SELECT * FROM 
        (SELECT *, ROW_NUMBER() OVER (PARTITION BY CONTINENT ORDER BY GDP DESC) AS RANK 
        FROM Countries_by_GDP) 
        WHERE RANK <=5)
        GROUP BY CONTINENT
        """, conn)

   AVG(GDP) continent
0   285.184        AF
1  6327.178        AS
2  3318.112        EU
3  6946.500        NA
4  1072.030        OC
5   791.566        SA

In [342]:
import etl_project_gdp as epg
epg.ETL_gdp()

          country       gdp
0   United States  30337.16
1           China  19534.89
2         Germany   4921.56
3           Japan   4389.33
4           India   4271.92
..            ...       ...
68     Uzbekistan    112.65
69      Guatemala    112.37
70           Oman    109.99
71       Bulgaria    108.42
72      Venezuela    106.33

[72 rows x 2 columns]
                gdp
continent
NA         6946.500
AS         6327.178
EU         3318.112
SA          791.566
OC          436.658
AF          285.184